public/ephemeris/2025-05-28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-org4870b50" class="outline-2">
<h2 id="org4870b50">2025-05-28 - Lucky and Unlucky</h2>
<div class="outline-text-2" id="text-org4870b50">
<p>
Hi,
</p>

<p>
today was both the unluckiest and luckiest day that I have memory
of. Let me explain why.
</p>

<p>
This afternoon I had to present a demo of what I have been working on
for my internship. Both a researcher from a company and my professor
were present, it was the opportunity to show my work to my supervisors
so it was a big moment.
</p>

<p>
In the morning I went to university to follow lessons, then went back
home and started preparing some slides. I setup the the local
kubernetes cluster and the operator, everything was compiled,
everything was working. Suddenly my laptop turns off, with no
sign of life, 30 minutes before the presentation.
</p>

<p>
Yes, this happened. All my development setup, the cluster, how could
I demo the program without a computer? You don't.
</p>

<p>
After 0.3 nanoseconds I booted up my desktop PC and began downloading
all the dependencies, cloning all my repositories, logging in on all
my accounts and finishing my slides. I had at least 4 terminals all
running different things in parallel, and I was switching between them
faster than I have ever done. I downloaded Kind and go, setup the
local cluster, deployed the operator and tested it. And somehow&#x2026;
everything worked! The internet connection, the fedora package
manager, all the dependencies were working well without additional
troubleshooting, the local cluster was online and ready, and my
application was working as expected (obviously). I finished installing
the last dependency the moment I joined the zoom call, that was
incredibly close.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
